export const problems = [{
    question: 'こんにちは！'
}, {
    stoneSize: 100,
    width: 3,
    height: 3,
    question: '茶色の地面の中に黒い点が並んでいます。どれかをタッチしてみましょう。',
    answer: null,
    explanation: 'お見事！\nタッチした場所に太い幹が成長して葉っぱがつきました。\n葉っぱは何枚つきましたか？場所によって4枚だったり3枚だったり2枚だったりします。'
}, {
    question: 'さっきとは違う場所をタッチしてみましょう。',
    answer: null,
    explanation: '今度は明るい緑の幹と葉が生えましたね。アレロは、二人が濃い緑と明るい緑それぞれを担当して、２種類の植物を交互に植えて戦うゲームです。'
}, {
    question: '配置が変わりました。\n地面には濃い緑の幹がひとつと明るい緑の幹がふたつずつあります。左上の明るい緑には葉が一枚しか残っていません。\n次は濃い緑の番です。左上の明るい緑の最後の一枚の葉を濃い緑で消してみてください。',
    blacks: [[1,2]],
    whites: [[1,1],[3,3]],
    answer: [2,1],
    explanation: 'お見事！\n葉のなくなった明るい緑は枯れてしまい、濃い緑で囲われた場所には濃い緑の芽が出ました。\n最初は明るい緑が多かったのに濃い緑のほうが多くなりました。\nアレロは、こうして自分の色の緑を相手よりたくさん植えたほうが勝ちのゲームです。'
}];